read_verilog test_2.v
read_verilog blackbox_clk_gates.v


hierarchy -check -top NfiVe32_RF
show -prefix before_all -format pdf NfiVe32_RF 
proc;
memory_nordff
show -prefix before_opt -format pdf NfiVe32_RF 
opt;; 

#memory_collect
memory_map
opt;; 


#show -prefix before -format pdf NfiVe32_RF 
#techmap -map mem_clkgate_map.v;;

show -prefix before -format pdf NfiVe32_RF 
techmap -map map_file.v;;

show -prefix  after_techmap_pass -format pdf NfiVe32_RF



#generic synthesis

synth -top NfiVe32_RF



#proc
#opt
#wreduce alumacc
#share
#opt
#fsm
#opt -fast 
#memory -nomap 
#opt_clean
#
#opt -fast -full
#memory_map 
#opt -full 
#techmap 
#opt -fast
#
#abc -fast
#opt -fast





#mapping to sky130 SCL
dfflibmap -liberty sky130_hd.lib 
abc -D 1250 -liberty sky130_hd.lib 

splitnets
opt_clean -purge


write_verilog -noattr -noexpr -nohex -nodec -defparam  test_outout_gatelevel.gl.v
write_blif  output.blif
write_edif  synth.edif