
read_verilog rf_64x64/rf_64x64.v
hierarchy -check -top rf_64x64

proc;
opt;; 
memory_collect
memory_map
opt;; 
synth -top rf_64x64
dfflibmap -liberty sky130_hd.lib 
abc -D 1250 -liberty sky130_hd.lib 
splitnets
opt_clean -purge
hilomap -hicell sky130_fd_sc_hd__conb_1 HI -locell sky130_fd_sc_hd__conb_1 LO
splitnets
opt_clean -purge
insbuf -buf sky130_fd_sc_hd__buf_2 A X
dffinit
opt;; 
write_verilog -noattr -noexpr -nohex -nodec -defparam   rf_64x64/before_gl.v
            