read_verilog test1.v
hierarchy -check -top test
proc;

show -prefix before_opt -format pdf test 
opt;; 



show -prefix before -format pdf test 
techmap -map map_file.v;;

show -prefix  after_techmap_pass -format pdf test



#generic synthesis

synth -top test



#proc
#opt
#wreduce alumacc
#share
#opt
#fsm
#opt -fast 
#memory -nomap 
#opt_clean
#
#opt -fast -full
#memory_map 
#opt -full 
#techmap 
#opt -fast
#
#abc -fast
#opt -fast





#mapping to sky130 SCL
dfflibmap -liberty sky130_hd.lib 
abc -D 1250 -liberty sky130_hd.lib 

splitnets
opt_clean -purge


write_verilog -noattr -noexpr -nohex -nodec -defparam  test_outout_gatelevel.gl.v
write_blif  output.blif
write_edif  synth.edif