
read_verilog designs/blake2s_core/blake2s_core.v
#hierarchy -check -top blake2s_core
hierarchy -check -top blake2s_core
proc;
opt;; 
memory_collect
memory_map
#async2sync
check
opt;; 
show -prefix  before_clkgate_pass -format pdf blake2s_core
#show -prefix  before_blake2s_core -format pdf blake2s_core
synth -top blake2s_core
dfflibmap -liberty lib/sky130_hd.lib 
abc -D 1250 -liberty lib/sky130_hd.lib 
#splitnets
#check
opt_clean -purge
hilomap -hicell sky130_fd_sc_hd__conb_1 HI -locell sky130_fd_sc_hd__conb_1 LO
#splitnets
opt_clean -purge
insbuf -buf sky130_fd_sc_hd__buf_2 A X
dffinit
opt;; 
check
write_verilog -noattr -noexpr -nohex -nodec -defparam   designs/blake2s_core/before_gl.v
            